{
  "Home": {
    "title": {
      "role": "นักพัฒนาเว็บและเกม",
      "name": "โกวิท ณรงค์ธุวพันธ์",
      "description": "จบการศึกษาจากมหาวิทยาลัยเชียงใหม่ เกียรตินิยมอันดับ 1 เรียนเกี่ยวกับการพัฒนาเกม สามารถใช้ Unity, Unreal Engine ในการสร้างเกมได้ดี และมีประสบการณ์เกี่ยวกับการพัฒนาเว็บไซต์",
      "email": "สามารถติดต่อผมได้ที่",
      "bullet1": "พัฒนาโปรเจ็กต์เกม Unity 3 โปรเจ็กต์และ Unreal 1 โปรเจ็กต์ที่มหาวิทยาลัยเชียงใหม่",
      "bullet2": "มีทักษะการทำงานร่วมกับผู้อื่น สามารถใช้งาน Maya, Adobe XD และ Figma เบื้องต้น",
      "bullet3": "มีประสบการณ์ด้านการพัฒนาเว็บทั้งหน้าบ้าน และหลังบ้านมากกว่า 1 ปี (Next.js, React.js, JavaScript, Typescript, PHP, REST API, Express.js, MySQL, Firebase)"
    },
    "web": {
      "title": "โปรเจ็กต์พัฒนาเว็บ",
      "muteru": {
        "title": "Muteru (2023)",
        "description": "Muteru แอพพลิเคชั่นสำหรับนักเดินทางที่สนใจในโชคลาภและไสยศาสตร์ผ่านเส้นทางการเดินทาง เสริมความรัก และความศรัทธา ไม่ว่าจะเส้นทางไหน มูเตลู จะช่วยเสริมดวงชะตาให้ชีวิตคุณประสบความสำเร็จทั้งด้านการงาน การงาน และชีวิตส่วนตัว"
      },
      "net-zero": {
        "title": "Net-Zero (2024)",
        "description": "Net Zero เป็น Web Application สำหรับแสดงค่าการใช้คาร์บอนที่ถูกใช้งานในมหาวิทยาลัยเชียงใหม่ โดยค่าต่าง ๆ จะแบ่งตามคณะ และสถานที่ในมหาวิทยาลัย หน้าเว็บไซต์จะแสดงเป็น Dashboard ควบคู่การใช้ 3D แสดงเป็นแผนที่"
      },
      "portfolio": {
        "title": "Portfolio (2024)",
        "description": "Web Application สำหรับแสดงผลงาน ที่พัฒนาด้วย Next.js เพื่อให้รองรับสำหรับการทำ SEO มากขึ้น สามารถเปลี่ยนภาษา และ Theme ได้ตามต้องการ"
      }
    },
    "game": {
      "title": "โปรเจ็กต์พัฒนาเกม",
      "castle-knight": {
        "title": "Castle Knight (2021)",
        "description": "Castle Knight เป็นเกม 2D Side-scroller ที่เกี่ยวกับการผจญภัย ซึ่งตัวเกมเพลย์หลัก ๆ คือการต่อสู้กับศัตรูภายในฉาก โดยผู้เล่นจะมีความสามารถเพียงแค่โจมตีกับป้องกันเท่านั้น สำหรับการรับมือศัตรูที่มีความสามารถแตกต่างกันออกไป"
      },
      "demon-hunter": {
        "title": "Demon Hunter (2022)",
        "description": "Demon Hunter เป็นเกม 2D Top-Down ที่ต้องจัดการมอนสเตอร์ที่เข้ามาหาผู้เล่น โดยผู้เล่นจะสามารถควบคุมได้ 4 ทิศทาง และมีอาวุธเป็นปืน ในเกมจะมีไอเท็มที่ดรอปมาจากมอนสเตอร์ เพื่อเพิ่มบัพการโจมตีให้กับผู้เล่น ผู้เล่นจะต้องอยู่ให้รอดจนหมดเวลาจึงจะชนะ"
      },
      "documents-master": {
        "title": "Documents Master (2022)",
        "description": "Documents Master เป็นเกม 3D Top-Down ที่เกี่ยวกับการจำลองการจัดการเอกสาร ในมหาวิทยาลัยเชียงใหม่ โดยตัวเกมจะอ้างอิงรูปแบบการเล่นจากเกม ที่มีชื่อว่า Overcooked โดยผู้เล่นจะต้องทำงานตามคำสั่งที่ถูกสุ่มให้ทันเวลา"
      },
      "dawn": {
        "title": "Dawn (2023)",
        "description": "Dawn เป็นเกม 3D ผู้เล่น 2 คน ผ่าน Online โดยผู้เล่นจะต้องช่วยกันพาลูกนกขึ้นไปยังรัง เกมนี้ผู้เล่นต้องอาศัยการร่วมมือ และความสามัคคีเพื่อให้ผ่านด่านไปให้ได้ โดยลูกนกสามารถเปลี่ยนธาตุต่าง ๆ ให้เหมาะสมกับสภาพแวดล้อมในเกม"
      }
    }
  }
}
